MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
// Register: LCDDATA62
#define LCDDATA62 LCDDATA62
extern volatile unsigned char           LCDDATA62           __at(0xECC);
#ifndef _LIB_BUILD
asm("LCDDATA62 equ 0ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C7                  :1;
        unsigned S49C7                  :1;
        unsigned S50C7                  :1;
        unsigned S51C7                  :1;
        unsigned S52C7                  :1;
        unsigned S53C7                  :1;
        unsigned S54C7                  :1;
        unsigned S55C7                  :1;
    };
} LCDDATA62bits_t;
extern volatile LCDDATA62bits_t LCDDATA62bits __at(0xECC);
// bitfield macros
#define _LCDDATA62_S48C7_POSN                               0x0
#define _LCDDATA62_S48C7_POSITION                           0x0
#define _LCDDATA62_S48C7_SIZE                               0x1
#define _LCDDATA62_S48C7_LENGTH                             0x1
#define _LCDDATA62_S48C7_MASK                               0x1
#define _LCDDATA62_S49C7_POSN                               0x1
#define _LCDDATA62_S49C7_POSITION                           0x1
#define _LCDDATA62_S49C7_SIZE                               0x1
#define _LCDDATA62_S49C7_LENGTH                             0x1
#define _LCDDATA62_S49C7_MASK                               0x2
#define _LCDDATA62_S50C7_POSN                               0x2
#define _LCDDATA62_S50C7_POSITION                           0x2
#define _LCDDATA62_S50C7_SIZE                               0x1
#define _LCDDATA62_S50C7_LENGTH                             0x1
#define _LCDDATA62_S50C7_MASK                               0x4
#define _LCDDATA62_S51C7_POSN                               0x3
#define _LCDDATA62_S51C7_POSITION                           0x3
#define _LCDDATA62_S51C7_SIZE                               0x1
#define _LCDDATA62_S51C7_LENGTH                             0x1
#define _LCDDATA62_S51C7_MASK                               0x8
#define _LCDDATA62_S52C7_POSN                               0x4
#define _LCDDATA62_S52C7_POSITION                           0x4
#define _LCDDATA62_S52C7_SIZE                               0x1
#define _LCDDATA62_S52C7_LENGTH                             0x1
#define _LCDDATA62_S52C7_MASK                               0x10
#define _LCDDATA62_S53C7_POSN                               0x5
#define _LCDDATA62_S53C7_POSITION                           0x5
#define _LCDDATA62_S53C7_SIZE                               0x1
#define _LCDDATA62_S53C7_LENGTH                             0x1
#define _LCDDATA62_S53C7_MASK                               0x20
#define _LCDDATA62_S54C7_POSN                               0x6
#define _LCDDATA62_S54C7_POSITION                           0x6
#define _LCDDATA62_S54C7_SIZE                               0x1
#define _LCDDATA62_S54C7_LENGTH                             0x1
#define _LCDDATA62_S54C7_MASK                               0x40
#define _LCDDATA62_S55C7_POSN                               0x7
#define _LCDDATA62_S55C7_POSITION                           0x7
#define _LCDDATA62_S55C7_SIZE                               0x1
#define _LCDDATA62_S55C7_LENGTH                             0x1
#define _LCDDATA62_S55C7_MASK                               0x80

// Register: LCDDATA63
#define LCDDATA63 LCDDATA63
extern volatile unsigned char           LCDDATA63           __at(0xECD);
#ifndef _LIB_BUILD
asm("LCDDATA63 equ 0ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C7                  :1;
        unsigned S57C7                  :1;
        unsigned S58C7                  :1;
        unsigned S59C7                  :1;
        unsigned S60C7                  :1;
        unsigned S61C7                  :1;
        unsigned S62C7                  :1;
        unsigned S63C7                  :1;
    };
} LCDDATA63bits_t;
extern volatile LCDDATA63bits_t LCDDATA63bits __at(0xECD);
// bitfield macros
#define _LCDDATA63_S56C7_POSN                               0x0
#define _LCDDATA63_S56C7_POSITION                           0x0
#define _LCDDATA63_S56C7_SIZE                               0x1
#define _LCDDATA63_S56C7_LENGTH                             0x1
#define _LCDDATA63_S56C7_MASK                               0x1
#define _LCDDATA63_S57C7_POSN                               0x1
#define _LCDDATA63_S57C7_POSITION                           0x1
#define _LCDDATA63_S57C7_SIZE                               0x1
#define _LCDDATA63_S57C7_LENGTH                             0x1
#define _LCDDATA63_S57C7_MASK                               0x2
#define _LCDDATA63_S58C7_POSN                               0x2
#define _LCDDATA63_S58C7_POSITION                           0x2
#define _LCDDATA63_S58C7_SIZE                               0x1
#define _LCDDATA63_S58C7_LENGTH                             0x1
#define _LCDDATA63_S58C7_MASK                               0x4
#define _LCDDATA63_S59C7_POSN                               0x3
#define _LCDDATA63_S59C7_POSITION                           0x3
#define _LCDDATA63_S59C7_SIZE                               0x1
#define _LCDDATA63_S59C7_LENGTH                             0x1
#define _LCDDATA63_S59C7_MASK                               0x8
#define _LCDDATA63_S60C7_POSN                               0x4
#define _LCDDATA63_S60C7_POSITION                           0x4
#define _LCDDATA63_S60C7_SIZE                               0x1
#define _LCDDATA63_S60C7_LENGTH                             0x1
#define _LCDDATA63_S60C7_MASK                               0x10
#define _LCDDATA63_S61C7_POSN                               0x5
#define _LCDDATA63_S61C7_POSITION                           0x5
#define _LCDDATA63_S61C7_SIZE                               0x1
#define _LCDDATA63_S61C7_LENGTH                             0x1
#define _LCDDATA63_S61C7_MASK                               0x20
#define _LCDDATA63_S62C7_POSN                               0x6
#define _LCDDATA63_S62C7_POSITION                           0x6
#define _LCDDATA63_S62C7_SIZE                               0x1
#define _LCDDATA63_S62C7_LENGTH                             0x1
#define _LCDDATA63_S62C7_MASK                               0x40
#define _LCDDATA63_S63C7_POSN                               0x7
#define _LCDDATA63_S63C7_POSITION                           0x7
#define _LCDDATA63_S63C7_SIZE                               0x1
#define _LCDDATA63_S63C7_LENGTH                             0x1
#define _LCDDATA63_S63C7_MASK                               0x80

// Register: LCDSE0
#define LCDSE0 LCDSE0
extern volatile unsigned char           LCDSE0              __at(0xECE);
#ifndef _LIB_BUILD
asm("LCDSE0 equ 0ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SE00                   :1;
        unsigned SE01                   :1;
        unsigned SE02                   :1;
        unsigned SE03                   :1;
        unsigned SE04                   :1;
        unsigned SE05                   :1;
        unsigned SE06                   :1;
        unsigned SE07                   :1;
    };
} LCDSE0bits_t;
