MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xEF2);
#ifndef _LIB_BUILD
asm("PMD2 equ 0EF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned TMR8MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xEF2);
// bitfield macros
#define _PMD2_TMR0MD_POSN                                   0x0
#define _PMD2_TMR0MD_POSITION                               0x0
#define _PMD2_TMR0MD_SIZE                                   0x1
#define _PMD2_TMR0MD_LENGTH                                 0x1
#define _PMD2_TMR0MD_MASK                                   0x1
#define _PMD2_TMR1MD_POSN                                   0x1
#define _PMD2_TMR1MD_POSITION                               0x1
#define _PMD2_TMR1MD_SIZE                                   0x1
#define _PMD2_TMR1MD_LENGTH                                 0x1
#define _PMD2_TMR1MD_MASK                                   0x2
#define _PMD2_TMR2MD_POSN                                   0x2
#define _PMD2_TMR2MD_POSITION                               0x2
#define _PMD2_TMR2MD_SIZE                                   0x1
#define _PMD2_TMR2MD_LENGTH                                 0x1
#define _PMD2_TMR2MD_MASK                                   0x4
#define _PMD2_TMR3MD_POSN                                   0x3
#define _PMD2_TMR3MD_POSITION                               0x3
#define _PMD2_TMR3MD_SIZE                                   0x1
#define _PMD2_TMR3MD_LENGTH                                 0x1
#define _PMD2_TMR3MD_MASK                                   0x8
#define _PMD2_TMR4MD_POSN                                   0x4
#define _PMD2_TMR4MD_POSITION                               0x4
#define _PMD2_TMR4MD_SIZE                                   0x1
#define _PMD2_TMR4MD_LENGTH                                 0x1
#define _PMD2_TMR4MD_MASK                                   0x10
#define _PMD2_TMR5MD_POSN                                   0x5
#define _PMD2_TMR5MD_POSITION                               0x5
#define _PMD2_TMR5MD_SIZE                                   0x1
#define _PMD2_TMR5MD_LENGTH                                 0x1
#define _PMD2_TMR5MD_MASK                                   0x20
#define _PMD2_TMR6MD_POSN                                   0x6
#define _PMD2_TMR6MD_POSITION                               0x6
#define _PMD2_TMR6MD_SIZE                                   0x1
#define _PMD2_TMR6MD_LENGTH                                 0x1
#define _PMD2_TMR6MD_MASK                                   0x40
#define _PMD2_TMR8MD_POSN                                   0x7
#define _PMD2_TMR8MD_POSITION                               0x7
#define _PMD2_TMR8MD_SIZE                                   0x1
#define _PMD2_TMR8MD_LENGTH                                 0x1
#define _PMD2_TMR8MD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xEF3);
#ifndef _LIB_BUILD
asm("PMD1 equ 0EF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1MD                 :1;
        unsigned SSP2MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned UART3MD                :1;
        unsigned UART4MD                :1;
        unsigned ECCP1MD                :1;
        unsigned ECCP2MD                :1;
    };
    struct {
        unsigned EMBMD                  :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0xEF3);
// bitfield macros
#define _PMD1_SSP1MD_POSN                                   0x0
#define _PMD1_SSP1MD_POSITION                               0x0
#define _PMD1_SSP1MD_SIZE                                   0x1
#define _PMD1_SSP1MD_LENGTH                                 0x1
#define _PMD1_SSP1MD_MASK                                   0x1
#define _PMD1_SSP2MD_POSN                                   0x1
#define _PMD1_SSP2MD_POSITION                               0x1
#define _PMD1_SSP2MD_SIZE                                   0x1
#define _PMD1_SSP2MD_LENGTH                                 0x1
#define _PMD1_SSP2MD_MASK                                   0x2
#define _PMD1_UART1MD_POSN                                  0x2
#define _PMD1_UART1MD_POSITION                              0x2
#define _PMD1_UART1MD_SIZE                                  0x1
#define _PMD1_UART1MD_LENGTH                                0x1
#define _PMD1_UART1MD_MASK                                  0x4
#define _PMD1_UART2MD_POSN                                  0x3
#define _PMD1_UART2MD_POSITION                              0x3
#define _PMD1_UART2MD_SIZE                                  0x1
#define _PMD1_UART2MD_LENGTH                                0x1
#define _PMD1_UART2MD_MASK                                  0x8
#define _PMD1_UART3MD_POSN                                  0x4
#define _PMD1_UART3MD_POSITION                              0x4
#define _PMD1_UART3MD_SIZE                                  0x1
#define _PMD1_UART3MD_LENGTH                                0x1
#define _PMD1_UART3MD_MASK                                  0x10
#define _PMD1_UART4MD_POSN                                  0x5
#define _PMD1_UART4MD_POSITION                              0x5
#define _PMD1_UART4MD_SIZE                                  0x1
#define _PMD1_UART4MD_LENGTH                                0x1
#define _PMD1_UART4MD_MASK                                  0x20
#define _PMD1_ECCP1MD_POSN                                  0x6
#define _PMD1_ECCP1MD_POSITION                              0x6
#define _PMD1_ECCP1MD_SIZE                                  0x1
#define _PMD1_ECCP1MD_LENGTH                                0x1
#define _PMD1_ECCP1MD_MASK                                  0x40
#define _PMD1_ECCP2MD_POSN                                  0x7
#define _PMD1_ECCP2MD_POSITION                              0x7
#define _PMD1_ECCP2MD_SIZE                                  0x1
#define _PMD1_ECCP2MD_LENGTH                                0x1
#define _PMD1_ECCP2MD_MASK                                  0x80
#define _PMD1_EMBMD_POSN                                    0x0
#define _PMD1_EMBMD_POSITION                                0x0
#define _PMD1_EMBMD_SIZE                                    0x1
#define _PMD1_EMBMD_LENGTH                                  0x1
#define _PMD1_EMBMD_MASK                                    0x1

