MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
extern volatile DSGPR2bits_t DSGPR2bits __at(0xF22);
// bitfield macros
#define _DSGPR2_DSGPR2_POSN                                 0x0
#define _DSGPR2_DSGPR2_POSITION                             0x0
#define _DSGPR2_DSGPR2_SIZE                                 0x8
#define _DSGPR2_DSGPR2_LENGTH                               0x8
#define _DSGPR2_DSGPR2_MASK                                 0xFF

// Register: DSGPR1
#define DSGPR1 DSGPR1
extern volatile unsigned char           DSGPR1              __at(0xF23);
#ifndef _LIB_BUILD
asm("DSGPR1 equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR1                 :8;
    };
} DSGPR1bits_t;
extern volatile DSGPR1bits_t DSGPR1bits __at(0xF23);
// bitfield macros
#define _DSGPR1_DSGPR1_POSN                                 0x0
#define _DSGPR1_DSGPR1_POSITION                             0x0
#define _DSGPR1_DSGPR1_SIZE                                 0x8
#define _DSGPR1_DSGPR1_LENGTH                               0x8
#define _DSGPR1_DSGPR1_MASK                                 0xFF

// Register: DSGPR0
#define DSGPR0 DSGPR0
extern volatile unsigned char           DSGPR0              __at(0xF24);
#ifndef _LIB_BUILD
asm("DSGPR0 equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR0                 :8;
    };
} DSGPR0bits_t;
extern volatile DSGPR0bits_t DSGPR0bits __at(0xF24);
// bitfield macros
#define _DSGPR0_DSGPR0_POSN                                 0x0
#define _DSGPR0_DSGPR0_POSITION                             0x0
#define _DSGPR0_DSGPR0_SIZE                                 0x8
#define _DSGPR0_DSGPR0_LENGTH                               0x8
#define _DSGPR0_DSGPR0_MASK                                 0xFF

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
extern volatile unsigned char           DSWAKEH             __at(0xF25);
#ifndef _LIB_BUILD
asm("DSWAKEH equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSINT0                 :1;
    };
} DSWAKEHbits_t;
extern volatile DSWAKEHbits_t DSWAKEHbits __at(0xF25);
// bitfield macros
#define _DSWAKEH_DSINT0_POSN                                0x0
#define _DSWAKEH_DSINT0_POSITION                            0x0
#define _DSWAKEH_DSINT0_SIZE                                0x1
#define _DSWAKEH_DSINT0_LENGTH                              0x1
#define _DSWAKEH_DSINT0_MASK                                0x1

// Register: DSWAKEL
#define DSWAKEL DSWAKEL
extern volatile unsigned char           DSWAKEL             __at(0xF26);
#ifndef _LIB_BUILD
asm("DSWAKEL equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSPOR                  :1;
        unsigned DSICD                  :1;
        unsigned DSMCLR                 :1;
        unsigned DSRTC                  :1;
        unsigned DSWDT                  :1;
        unsigned DSULP                  :1;
        unsigned BOR                    :1;
        unsigned DSFLT                  :1;
    };
} DSWAKELbits_t;
extern volatile DSWAKELbits_t DSWAKELbits __at(0xF26);
// bitfield macros
#define _DSWAKEL_DSPOR_POSN                                 0x0
#define _DSWAKEL_DSPOR_POSITION                             0x0
#define _DSWAKEL_DSPOR_SIZE                                 0x1
#define _DSWAKEL_DSPOR_LENGTH                               0x1
#define _DSWAKEL_DSPOR_MASK                                 0x1
#define _DSWAKEL_DSICD_POSN                                 0x1
#define _DSWAKEL_DSICD_POSITION                             0x1
#define _DSWAKEL_DSICD_SIZE                                 0x1
#define _DSWAKEL_DSICD_LENGTH                               0x1
#define _DSWAKEL_DSICD_MASK                                 0x2
#define _DSWAKEL_DSMCLR_POSN                                0x2
#define _DSWAKEL_DSMCLR_POSITION                            0x2
#define _DSWAKEL_DSMCLR_SIZE                                0x1
#define _DSWAKEL_DSMCLR_LENGTH                              0x1
#define _DSWAKEL_DSMCLR_MASK                                0x4
#define _DSWAKEL_DSRTC_POSN                                 0x3
#define _DSWAKEL_DSRTC_POSITION                             0x3
#define _DSWAKEL_DSRTC_SIZE                                 0x1
#define _DSWAKEL_DSRTC_LENGTH                               0x1
#define _DSWAKEL_DSRTC_MASK                                 0x8
#define _DSWAKEL_DSWDT_POSN                                 0x4
#define _DSWAKEL_DSWDT_POSITION                             0x4
#define _DSWAKEL_DSWDT_SIZE                                 0x1
#define _DSWAKEL_DSWDT_LENGTH                               0x1
#define _DSWAKEL_DSWDT_MASK                                 0x10
#define _DSWAKEL_DSULP_POSN                                 0x5
#define _DSWAKEL_DSULP_POSITION                             0x5
#define _DSWAKEL_DSULP_SIZE                                 0x1
#define _DSWAKEL_DSULP_LENGTH                               0x1
#define _DSWAKEL_DSULP_MASK                                 0x20
#define _DSWAKEL_BOR_POSN                                   0x6
#define _DSWAKEL_BOR_POSITION                               0x6
#define _DSWAKEL_BOR_SIZE                                   0x1
#define _DSWAKEL_BOR_LENGTH                                 0x1
#define _DSWAKEL_BOR_MASK                                   0x40
#define _DSWAKEL_DSFLT_POSN                                 0x7
#define _DSWAKEL_DSFLT_POSITION                             0x7
#define _DSWAKEL_DSFLT_SIZE                                 0x1
#define _DSWAKEL_DSFLT_LENGTH                               0x1
#define _DSWAKEL_DSFLT_MASK                                 0x80

// Register: DSCONH
#define DSCONH DSCONH
extern volatile unsigned char           DSCONH              __at(0xF27);
#ifndef _LIB_BUILD
asm("DSCONH equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCWDIS                :1;
        unsigned                        :6;
        unsigned DSEN                   :1;
    };
} DSCONHbits_t;
extern volatile DSCONHbits_t DSCONHbits __at(0xF27);
// bitfield macros
#define _DSCONH_RTCWDIS_POSN                                0x0
#define _DSCONH_RTCWDIS_POSITION                            0x0
#define _DSCONH_RTCWDIS_SIZE                                0x1
#define _DSCONH_RTCWDIS_LENGTH                              0x1
#define _DSCONH_RTCWDIS_MASK                                0x1
#define _DSCONH_DSEN_POSN                                   0x7
#define _DSCONH_DSEN_POSITION                               0x7
#define _DSCONH_DSEN_SIZE                                   0x1
#define _DSCONH_DSEN_LENGTH                                 0x1
#define _DSCONH_DSEN_MASK                                   0x80

// Register: DSCONL
#define DSCONL DSCONL
extern volatile unsigned char           DSCONL              __at(0xF28);
#ifndef _LIB_BUILD
asm("DSCONL equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RELEASE                :1;
        unsigned DSBOR                  :1;
        unsigned ULPWDIS                :1;
    };
} DSCONLbits_t;
extern volatile DSCONLbits_t DSCONLbits __at(0xF28);
// bitfield macros
#define _DSCONL_RELEASE_POSN                                0x0
#define _DSCONL_RELEASE_POSITION                            0x0
#define _DSCONL_RELEASE_SIZE                                0x1
#define _DSCONL_RELEASE_LENGTH                              0x1
#define _DSCONL_RELEASE_MASK                                0x1
#define _DSCONL_DSBOR_POSN                                  0x1
#define _DSCONL_DSBOR_POSITION                              0x1
#define _DSCONL_DSBOR_SIZE                                  0x1
#define _DSCONL_DSBOR_LENGTH                                0x1
#define _DSCONL_DSBOR_MASK                                  0x2
#define _DSCONL_ULPWDIS_POSN                                0x2
#define _DSCONL_ULPWDIS_POSITION                            0x2
#define _DSCONL_ULPWDIS_SIZE                                0x1
#define _DSCONL_ULPWDIS_LENGTH                              0x1
#define _DSCONL_ULPWDIS_MASK                                0x4

// Register: TXREG3
#define TXREG3 TXREG3
extern volatile unsigned char           TXREG3              __at(0xF29);
#ifndef _LIB_BUILD
asm("TXREG3 equ 0F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXREG3                 :8;
    };
} TXREG3bits_t;
extern volatile TXREG3bits_t TXREG3bits __at(0xF29);
// bitfield macros
#define _TXREG3_TXREG3_POSN                                 0x0
#define _TXREG3_TXREG3_POSITION                             0x0
#define _TXREG3_TXREG3_SIZE                                 0x8
#define _TXREG3_TXREG3_LENGTH                               0x8
#define _TXREG3_TXREG3_MASK                                 0xFF

// Register: RCREG3
#define RCREG3 RCREG3
extern volatile unsigned char           RCREG3              __at(0xF2A);
#ifndef _LIB_BUILD
asm("RCREG3 equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RCREG3                 :8;
    };
} RCREG3bits_t;
extern volatile RCREG3bits_t RCREG3bits __at(0xF2A);
// bitfield macros
#define _RCREG3_RCREG3_POSN                                 0x0
#define _RCREG3_RCREG3_POSITION                             0x0
#define _RCREG3_RCREG3_SIZE                                 0x8
#define _RCREG3_RCREG3_LENGTH                               0x8
#define _RCREG3_RCREG3_MASK                                 0xFF

// Register: SPBRG3
#define SPBRG3 SPBRG3
extern volatile unsigned char           SPBRG3              __at(0xF2B);
#ifndef _LIB_BUILD
asm("SPBRG3 equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRG3                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRG3bits_t;
extern volatile SPBRG3bits_t SPBRG3bits __at(0xF2B);
// bitfield macros
#define _SPBRG3_SPBRG3_POSN                                 0x0
#define _SPBRG3_SPBRG3_POSITION                             0x0
#define _SPBRG3_SPBRG3_SIZE                                 0x8
#define _SPBRG3_SPBRG3_LENGTH                               0x8
#define _SPBRG3_SPBRG3_MASK                                 0xFF
#define _SPBRG3_BRG0_POSN                                   0x0
#define _SPBRG3_BRG0_POSITION                               0x0
#define _SPBRG3_BRG0_SIZE                                   0x1
#define _SPBRG3_BRG0_LENGTH                                 0x1
#define _SPBRG3_BRG0_MASK                                   0x1
#define _SPBRG3_BRG1_POSN                                   0x1
#define _SPBRG3_BRG1_POSITION                               0x1
#define _SPBRG3_BRG1_SIZE                                   0x1
#define _SPBRG3_BRG1_LENGTH                                 0x1
#define _SPBRG3_BRG1_MASK                                   0x2
#define _SPBRG3_BRG2_POSN                                   0x2
#define _SPBRG3_BRG2_POSITION                               0x2
#define _SPBRG3_BRG2_SIZE                                   0x1
#define _SPBRG3_BRG2_LENGTH                                 0x1
#define _SPBRG3_BRG2_MASK                                   0x4
#define _SPBRG3_BRG3_POSN                                   0x3
#define _SPBRG3_BRG3_POSITION                               0x3
#define _SPBRG3_BRG3_SIZE                                   0x1
#define _SPBRG3_BRG3_LENGTH                                 0x1
#define _SPBRG3_BRG3_MASK                                   0x8
#define _SPBRG3_BRG4_POSN                                   0x4
#define _SPBRG3_BRG4_POSITION                               0x4
#define _SPBRG3_BRG4_SIZE                                   0x1
#define _SPBRG3_BRG4_LENGTH                                 0x1
#define _SPBRG3_BRG4_MASK                                   0x10
#define _SPBRG3_BRG5_POSN                                   0x5
#define _SPBRG3_BRG5_POSITION                               0x5
#define _SPBRG3_BRG5_SIZE                                   0x1
#define _SPBRG3_BRG5_LENGTH                                 0x1
#define _SPBRG3_BRG5_MASK                                   0x20
#define _SPBRG3_BRG6_POSN                                   0x6
#define _SPBRG3_BRG6_POSITION                               0x6
#define _SPBRG3_BRG6_SIZE                                   0x1
#define _SPBRG3_BRG6_LENGTH                                 0x1
#define _SPBRG3_BRG6_MASK                                   0x40
#define _SPBRG3_BRG7_POSN                                   0x7
#define _SPBRG3_BRG7_POSITION                               0x7
#define _SPBRG3_BRG7_SIZE                                   0x1
#define _SPBRG3_BRG7_LENGTH                                 0x1
#define _SPBRG3_BRG7_MASK                                   0x80

// Register: SPBRGH3
#define SPBRGH3 SPBRGH3
extern volatile unsigned char           SPBRGH3             __at(0xF2C);
#ifndef _LIB_BUILD
asm("SPBRGH3 equ 0F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH3                :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGH3bits_t;
extern volatile SPBRGH3bits_t SPBRGH3bits __at(0xF2C);
// bitfield macros
#define _SPBRGH3_SPBRGH3_POSN                               0x0
#define _SPBRGH3_SPBRGH3_POSITION                           0x0
#define _SPBRGH3_SPBRGH3_SIZE                               0x8
#define _SPBRGH3_SPBRGH3_LENGTH                             0x8
#define _SPBRGH3_SPBRGH3_MASK                               0xFF
#define _SPBRGH3_BRG8_POSN                                  0x0
#define _SPBRGH3_BRG8_POSITION                              0x0
#define _SPBRGH3_BRG8_SIZE                                  0x1
#define _SPBRGH3_BRG8_LENGTH                                0x1
#define _SPBRGH3_BRG8_MASK                                  0x1
#define _SPBRGH3_BRG9_POSN                                  0x1
#define _SPBRGH3_BRG9_POSITION                              0x1
#define _SPBRGH3_BRG9_SIZE                                  0x1
#define _SPBRGH3_BRG9_LENGTH                                0x1
#define _SPBRGH3_BRG9_MASK                                  0x2
#define _SPBRGH3_BRG10_POSN                                 0x2
#define _SPBRGH3_BRG10_POSITION                             0x2
#define _SPBRGH3_BRG10_SIZE                                 0x1
#define _SPBRGH3_BRG10_LENGTH                               0x1
#define _SPBRGH3_BRG10_MASK                                 0x4
#define _SPBRGH3_BRG11_POSN                                 0x3
#define _SPBRGH3_BRG11_POSITION                             0x3
#define _SPBRGH3_BRG11_SIZE                                 0x1
#define _SPBRGH3_BRG11_LENGTH                               0x1
#define _SPBRGH3_BRG11_MASK                                 0x8
#define _SPBRGH3_BRG12_POSN                                 0x4
#define _SPBRGH3_BRG12_POSITION                             0x4
#define _SPBRGH3_BRG12_SIZE                                 0x1
#define _SPBRGH3_BRG12_LENGTH                               0x1
#define _SPBRGH3_BRG12_MASK                                 0x10
#define _SPBRGH3_BRG13_POSN                                 0x5
#define _SPBRGH3_BRG13_POSITION                             0x5
#define _SPBRGH3_BRG13_SIZE                                 0x1
#define _SPBRGH3_BRG13_LENGTH                               0x1
#define _SPBRGH3_BRG13_MASK                                 0x20
#define _SPBRGH3_BRG14_POSN                                 0x6
#define _SPBRGH3_BRG14_POSITION                             0x6
#define _SPBRGH3_BRG14_SIZE                                 0x1
#define _SPBRGH3_BRG14_LENGTH                               0x1
#define _SPBRGH3_BRG14_MASK                                 0x40
#define _SPBRGH3_BRG15_POSN                                 0x7
#define _SPBRGH3_BRG15_POSITION                             0x7
#define _SPBRGH3_BRG15_SIZE                                 0x1
#define _SPBRGH3_BRG15_LENGTH                               0x1
#define _SPBRGH3_BRG15_MASK                                 0x80

// Register: BAUDCON3
#define BAUDCON3 BAUDCON3
extern volatile unsigned char           BAUDCON3            __at(0xF2D);
#ifndef _LIB_BUILD
asm("BAUDCON3 equ 0F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned IREN                   :1;
        unsigned BRG16                  :1;
        unsigned TXCKP                  :1;
        unsigned RXDTP                  :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN3                 :1;
        unsigned WUE3                   :1;
        unsigned                        :1;
        unsigned BRG163                 :1;
        unsigned SCKP3                  :1;
        unsigned DTRXP3                 :1;
        unsigned RCIDL3                 :1;
        unsigned ABDOVF3                :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP3                 :1;
        unsigned RXDTP3                 :1;
        unsigned RCMT3                  :1;
    };
} BAUDCON3bits_t;
