MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
extern volatile BAUDCON3bits_t BAUDCON3bits __at(0xF2D);
// bitfield macros
#define _BAUDCON3_ABDEN_POSN                                0x0
#define _BAUDCON3_ABDEN_POSITION                            0x0
#define _BAUDCON3_ABDEN_SIZE                                0x1
#define _BAUDCON3_ABDEN_LENGTH                              0x1
#define _BAUDCON3_ABDEN_MASK                                0x1
#define _BAUDCON3_WUE_POSN                                  0x1
#define _BAUDCON3_WUE_POSITION                              0x1
#define _BAUDCON3_WUE_SIZE                                  0x1
#define _BAUDCON3_WUE_LENGTH                                0x1
#define _BAUDCON3_WUE_MASK                                  0x2
#define _BAUDCON3_IREN_POSN                                 0x2
#define _BAUDCON3_IREN_POSITION                             0x2
#define _BAUDCON3_IREN_SIZE                                 0x1
#define _BAUDCON3_IREN_LENGTH                               0x1
#define _BAUDCON3_IREN_MASK                                 0x4
#define _BAUDCON3_BRG16_POSN                                0x3
#define _BAUDCON3_BRG16_POSITION                            0x3
#define _BAUDCON3_BRG16_SIZE                                0x1
#define _BAUDCON3_BRG16_LENGTH                              0x1
#define _BAUDCON3_BRG16_MASK                                0x8
#define _BAUDCON3_TXCKP_POSN                                0x4
#define _BAUDCON3_TXCKP_POSITION                            0x4
#define _BAUDCON3_TXCKP_SIZE                                0x1
#define _BAUDCON3_TXCKP_LENGTH                              0x1
#define _BAUDCON3_TXCKP_MASK                                0x10
#define _BAUDCON3_RXDTP_POSN                                0x5
#define _BAUDCON3_RXDTP_POSITION                            0x5
#define _BAUDCON3_RXDTP_SIZE                                0x1
#define _BAUDCON3_RXDTP_LENGTH                              0x1
#define _BAUDCON3_RXDTP_MASK                                0x20
#define _BAUDCON3_RCIDL_POSN                                0x6
#define _BAUDCON3_RCIDL_POSITION                            0x6
#define _BAUDCON3_RCIDL_SIZE                                0x1
#define _BAUDCON3_RCIDL_LENGTH                              0x1
#define _BAUDCON3_RCIDL_MASK                                0x40
#define _BAUDCON3_ABDOVF_POSN                               0x7
#define _BAUDCON3_ABDOVF_POSITION                           0x7
#define _BAUDCON3_ABDOVF_SIZE                               0x1
#define _BAUDCON3_ABDOVF_LENGTH                             0x1
#define _BAUDCON3_ABDOVF_MASK                               0x80
#define _BAUDCON3_ABDEN3_POSN                               0x0
#define _BAUDCON3_ABDEN3_POSITION                           0x0
#define _BAUDCON3_ABDEN3_SIZE                               0x1
#define _BAUDCON3_ABDEN3_LENGTH                             0x1
#define _BAUDCON3_ABDEN3_MASK                               0x1
#define _BAUDCON3_WUE3_POSN                                 0x1
#define _BAUDCON3_WUE3_POSITION                             0x1
#define _BAUDCON3_WUE3_SIZE                                 0x1
#define _BAUDCON3_WUE3_LENGTH                               0x1
#define _BAUDCON3_WUE3_MASK                                 0x2
#define _BAUDCON3_BRG163_POSN                               0x3
#define _BAUDCON3_BRG163_POSITION                           0x3
#define _BAUDCON3_BRG163_SIZE                               0x1
#define _BAUDCON3_BRG163_LENGTH                             0x1
#define _BAUDCON3_BRG163_MASK                               0x8
#define _BAUDCON3_SCKP3_POSN                                0x4
#define _BAUDCON3_SCKP3_POSITION                            0x4
#define _BAUDCON3_SCKP3_SIZE                                0x1
#define _BAUDCON3_SCKP3_LENGTH                              0x1
#define _BAUDCON3_SCKP3_MASK                                0x10
#define _BAUDCON3_DTRXP3_POSN                               0x5
#define _BAUDCON3_DTRXP3_POSITION                           0x5
#define _BAUDCON3_DTRXP3_SIZE                               0x1
#define _BAUDCON3_DTRXP3_LENGTH                             0x1
#define _BAUDCON3_DTRXP3_MASK                               0x20
#define _BAUDCON3_RCIDL3_POSN                               0x6
#define _BAUDCON3_RCIDL3_POSITION                           0x6
#define _BAUDCON3_RCIDL3_SIZE                               0x1
#define _BAUDCON3_RCIDL3_LENGTH                             0x1
#define _BAUDCON3_RCIDL3_MASK                               0x40
#define _BAUDCON3_ABDOVF3_POSN                              0x7
#define _BAUDCON3_ABDOVF3_POSITION                          0x7
#define _BAUDCON3_ABDOVF3_SIZE                              0x1
#define _BAUDCON3_ABDOVF3_LENGTH                            0x1
#define _BAUDCON3_ABDOVF3_MASK                              0x80
#define _BAUDCON3_TXCKP3_POSN                               0x4
#define _BAUDCON3_TXCKP3_POSITION                           0x4
#define _BAUDCON3_TXCKP3_SIZE                               0x1
#define _BAUDCON3_TXCKP3_LENGTH                             0x1
#define _BAUDCON3_TXCKP3_MASK                               0x10
#define _BAUDCON3_RXDTP3_POSN                               0x5
#define _BAUDCON3_RXDTP3_POSITION                           0x5
#define _BAUDCON3_RXDTP3_SIZE                               0x1
#define _BAUDCON3_RXDTP3_LENGTH                             0x1
#define _BAUDCON3_RXDTP3_MASK                               0x20
#define _BAUDCON3_RCMT3_POSN                                0x6
#define _BAUDCON3_RCMT3_POSITION                            0x6
#define _BAUDCON3_RCMT3_SIZE                                0x1
#define _BAUDCON3_RCMT3_LENGTH                              0x1
#define _BAUDCON3_RCMT3_MASK                                0x40

// Register: TXSTA3
#define TXSTA3 TXSTA3
extern volatile unsigned char           TXSTA3              __at(0xF2E);
#ifndef _LIB_BUILD
asm("TXSTA3 equ 0F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TXD83                  :1;
        unsigned                        :5;
        unsigned TX8_93                 :1;
    };
} TXSTA3bits_t;
extern volatile TXSTA3bits_t TXSTA3bits __at(0xF2E);
// bitfield macros
#define _TXSTA3_TX9D_POSN                                   0x0
#define _TXSTA3_TX9D_POSITION                               0x0
#define _TXSTA3_TX9D_SIZE                                   0x1
#define _TXSTA3_TX9D_LENGTH                                 0x1
#define _TXSTA3_TX9D_MASK                                   0x1
#define _TXSTA3_TRMT_POSN                                   0x1
#define _TXSTA3_TRMT_POSITION                               0x1
#define _TXSTA3_TRMT_SIZE                                   0x1
#define _TXSTA3_TRMT_LENGTH                                 0x1
#define _TXSTA3_TRMT_MASK                                   0x2
#define _TXSTA3_BRGH_POSN                                   0x2
#define _TXSTA3_BRGH_POSITION                               0x2
#define _TXSTA3_BRGH_SIZE                                   0x1
#define _TXSTA3_BRGH_LENGTH                                 0x1
#define _TXSTA3_BRGH_MASK                                   0x4
#define _TXSTA3_SENDB_POSN                                  0x3
#define _TXSTA3_SENDB_POSITION                              0x3
#define _TXSTA3_SENDB_SIZE                                  0x1
#define _TXSTA3_SENDB_LENGTH                                0x1
#define _TXSTA3_SENDB_MASK                                  0x8
#define _TXSTA3_SYNC_POSN                                   0x4
#define _TXSTA3_SYNC_POSITION                               0x4
#define _TXSTA3_SYNC_SIZE                                   0x1
#define _TXSTA3_SYNC_LENGTH                                 0x1
#define _TXSTA3_SYNC_MASK                                   0x10
#define _TXSTA3_TXEN_POSN                                   0x5
#define _TXSTA3_TXEN_POSITION                               0x5
#define _TXSTA3_TXEN_SIZE                                   0x1
#define _TXSTA3_TXEN_LENGTH                                 0x1
#define _TXSTA3_TXEN_MASK                                   0x20
#define _TXSTA3_TX9_POSN                                    0x6
#define _TXSTA3_TX9_POSITION                                0x6
#define _TXSTA3_TX9_SIZE                                    0x1
#define _TXSTA3_TX9_LENGTH                                  0x1
#define _TXSTA3_TX9_MASK                                    0x40
#define _TXSTA3_CSRC_POSN                                   0x7
#define _TXSTA3_CSRC_POSITION                               0x7
#define _TXSTA3_CSRC_SIZE                                   0x1
#define _TXSTA3_CSRC_LENGTH                                 0x1
#define _TXSTA3_CSRC_MASK                                   0x80
#define _TXSTA3_TXD83_POSN                                  0x0
#define _TXSTA3_TXD83_POSITION                              0x0
#define _TXSTA3_TXD83_SIZE                                  0x1
#define _TXSTA3_TXD83_LENGTH                                0x1
#define _TXSTA3_TXD83_MASK                                  0x1
#define _TXSTA3_TX8_93_POSN                                 0x6
#define _TXSTA3_TX8_93_POSITION                             0x6
#define _TXSTA3_TX8_93_SIZE                                 0x1
#define _TXSTA3_TX8_93_LENGTH                               0x1
#define _TXSTA3_TX8_93_MASK                                 0x40

// Register: RCSTA3
#define RCSTA3 RCSTA3
extern volatile unsigned char           RCSTA3              __at(0xF2F);
#ifndef _LIB_BUILD
asm("RCSTA3 equ 0F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned RCD83                  :1;
        unsigned                        :5;
        unsigned RC8_92                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC93                   :1;
    };
} RCSTA3bits_t;
