MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
// Register: UFRML
#define UFRML UFRML
extern volatile unsigned char           UFRML               __at(0xF7A);
#ifndef _LIB_BUILD
asm("UFRML equ 0F7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FRM                    :8;
    };
    struct {
        unsigned FRM0                   :1;
        unsigned FRM1                   :1;
        unsigned FRM2                   :1;
        unsigned FRM3                   :1;
        unsigned FRM4                   :1;
        unsigned FRM5                   :1;
        unsigned FRM6                   :1;
        unsigned FRM7                   :1;
    };
    struct {
        unsigned FRML                   :8;
    };
} UFRMLbits_t;
extern volatile UFRMLbits_t UFRMLbits __at(0xF7A);
// bitfield macros
#define _UFRML_FRM_POSN                                     0x0
#define _UFRML_FRM_POSITION                                 0x0
#define _UFRML_FRM_SIZE                                     0x8
#define _UFRML_FRM_LENGTH                                   0x8
#define _UFRML_FRM_MASK                                     0xFF
#define _UFRML_FRM0_POSN                                    0x0
#define _UFRML_FRM0_POSITION                                0x0
#define _UFRML_FRM0_SIZE                                    0x1
#define _UFRML_FRM0_LENGTH                                  0x1
#define _UFRML_FRM0_MASK                                    0x1
#define _UFRML_FRM1_POSN                                    0x1
#define _UFRML_FRM1_POSITION                                0x1
#define _UFRML_FRM1_SIZE                                    0x1
#define _UFRML_FRM1_LENGTH                                  0x1
#define _UFRML_FRM1_MASK                                    0x2
#define _UFRML_FRM2_POSN                                    0x2
#define _UFRML_FRM2_POSITION                                0x2
#define _UFRML_FRM2_SIZE                                    0x1
#define _UFRML_FRM2_LENGTH                                  0x1
#define _UFRML_FRM2_MASK                                    0x4
#define _UFRML_FRM3_POSN                                    0x3
#define _UFRML_FRM3_POSITION                                0x3
#define _UFRML_FRM3_SIZE                                    0x1
#define _UFRML_FRM3_LENGTH                                  0x1
#define _UFRML_FRM3_MASK                                    0x8
#define _UFRML_FRM4_POSN                                    0x4
#define _UFRML_FRM4_POSITION                                0x4
#define _UFRML_FRM4_SIZE                                    0x1
#define _UFRML_FRM4_LENGTH                                  0x1
#define _UFRML_FRM4_MASK                                    0x10
#define _UFRML_FRM5_POSN                                    0x5
#define _UFRML_FRM5_POSITION                                0x5
#define _UFRML_FRM5_SIZE                                    0x1
#define _UFRML_FRM5_LENGTH                                  0x1
#define _UFRML_FRM5_MASK                                    0x20
#define _UFRML_FRM6_POSN                                    0x6
#define _UFRML_FRM6_POSITION                                0x6
#define _UFRML_FRM6_SIZE                                    0x1
#define _UFRML_FRM6_LENGTH                                  0x1
#define _UFRML_FRM6_MASK                                    0x40
#define _UFRML_FRM7_POSN                                    0x7
#define _UFRML_FRM7_POSITION                                0x7
#define _UFRML_FRM7_SIZE                                    0x1
#define _UFRML_FRM7_LENGTH                                  0x1
#define _UFRML_FRM7_MASK                                    0x80
#define _UFRML_FRML_POSN                                    0x0
#define _UFRML_FRML_POSITION                                0x0
#define _UFRML_FRML_SIZE                                    0x8
#define _UFRML_FRML_LENGTH                                  0x8
#define _UFRML_FRML_MASK                                    0xFF

// Register: RCON4
#define RCON4 RCON4
extern volatile unsigned char           RCON4               __at(0xF7B);
#ifndef _LIB_BUILD
asm("RCON4 equ 0F7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMSLP                  :1;
        unsigned                        :1;
        unsigned DPSLP                  :1;
        unsigned                        :1;
        unsigned SRETEN                 :1;
    };
} RCON4bits_t;
extern volatile RCON4bits_t RCON4bits __at(0xF7B);
// bitfield macros
#define _RCON4_PMSLP_POSN                                   0x0
#define _RCON4_PMSLP_POSITION                               0x0
#define _RCON4_PMSLP_SIZE                                   0x1
#define _RCON4_PMSLP_LENGTH                                 0x1
#define _RCON4_PMSLP_MASK                                   0x1
#define _RCON4_DPSLP_POSN                                   0x2
#define _RCON4_DPSLP_POSITION                               0x2
#define _RCON4_DPSLP_SIZE                                   0x1
#define _RCON4_DPSLP_LENGTH                                 0x1
#define _RCON4_DPSLP_MASK                                   0x4
#define _RCON4_SRETEN_POSN                                  0x4
#define _RCON4_SRETEN_POSITION                              0x4
#define _RCON4_SRETEN_SIZE                                  0x1
#define _RCON4_SRETEN_LENGTH                                0x1
#define _RCON4_SRETEN_MASK                                  0x10

// Register: RCON3
#define RCON3 RCON3
extern volatile unsigned char           RCON3               __at(0xF7C);
#ifndef _LIB_BUILD
asm("RCON3 equ 0F7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VBAT                   :1;
        unsigned VBPOR                  :1;
        unsigned VDDPOR                 :1;
        unsigned VDDBOR                 :1;
        unsigned                        :3;
        unsigned STKERR                 :1;
    };
} RCON3bits_t;
extern volatile RCON3bits_t RCON3bits __at(0xF7C);
// bitfield macros
#define _RCON3_VBAT_POSN                                    0x0
#define _RCON3_VBAT_POSITION                                0x0
#define _RCON3_VBAT_SIZE                                    0x1
#define _RCON3_VBAT_LENGTH                                  0x1
#define _RCON3_VBAT_MASK                                    0x1
#define _RCON3_VBPOR_POSN                                   0x1
#define _RCON3_VBPOR_POSITION                               0x1
#define _RCON3_VBPOR_SIZE                                   0x1
#define _RCON3_VBPOR_LENGTH                                 0x1
#define _RCON3_VBPOR_MASK                                   0x2
#define _RCON3_VDDPOR_POSN                                  0x2
#define _RCON3_VDDPOR_POSITION                              0x2
#define _RCON3_VDDPOR_SIZE                                  0x1
#define _RCON3_VDDPOR_LENGTH                                0x1
#define _RCON3_VDDPOR_MASK                                  0x4
#define _RCON3_VDDBOR_POSN                                  0x3
#define _RCON3_VDDBOR_POSITION                              0x3
#define _RCON3_VDDBOR_SIZE                                  0x1
#define _RCON3_VDDBOR_LENGTH                                0x1
#define _RCON3_VDDBOR_MASK                                  0x8
#define _RCON3_STKERR_POSN                                  0x7
#define _RCON3_STKERR_POSITION                              0x7
#define _RCON3_STKERR_SIZE                                  0x1
#define _RCON3_STKERR_LENGTH                                0x1
#define _RCON3_STKERR_MASK                                  0x80

// Register: RCON2
#define RCON2 RCON2
extern volatile unsigned char           RCON2               __at(0xF7D);
#ifndef _LIB_BUILD
asm("RCON2 equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned SWDTEN                 :1;
        unsigned                        :1;
        unsigned EXTR                   :1;
    };
} RCON2bits_t;
