MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
extern volatile HLVDCONbits_t HLVDCONbits __at(0xFA8);
// bitfield macros
#define _HLVDCON_HLVDL_POSN                                 0x0
#define _HLVDCON_HLVDL_POSITION                             0x0
#define _HLVDCON_HLVDL_SIZE                                 0x4
#define _HLVDCON_HLVDL_LENGTH                               0x4
#define _HLVDCON_HLVDL_MASK                                 0xF
#define _HLVDCON_HLVDEN_POSN                                0x4
#define _HLVDCON_HLVDEN_POSITION                            0x4
#define _HLVDCON_HLVDEN_SIZE                                0x1
#define _HLVDCON_HLVDEN_LENGTH                              0x1
#define _HLVDCON_HLVDEN_MASK                                0x10
#define _HLVDCON_IRVST_POSN                                 0x5
#define _HLVDCON_IRVST_POSITION                             0x5
#define _HLVDCON_IRVST_SIZE                                 0x1
#define _HLVDCON_IRVST_LENGTH                               0x1
#define _HLVDCON_IRVST_MASK                                 0x20
#define _HLVDCON_BGVST_POSN                                 0x6
#define _HLVDCON_BGVST_POSITION                             0x6
#define _HLVDCON_BGVST_SIZE                                 0x1
#define _HLVDCON_BGVST_LENGTH                               0x1
#define _HLVDCON_BGVST_MASK                                 0x40
#define _HLVDCON_VDIRMAG_POSN                               0x7
#define _HLVDCON_VDIRMAG_POSITION                           0x7
#define _HLVDCON_VDIRMAG_SIZE                               0x1
#define _HLVDCON_VDIRMAG_LENGTH                             0x1
#define _HLVDCON_VDIRMAG_MASK                               0x80
#define _HLVDCON_HLVDL0_POSN                                0x0
#define _HLVDCON_HLVDL0_POSITION                            0x0
#define _HLVDCON_HLVDL0_SIZE                                0x1
#define _HLVDCON_HLVDL0_LENGTH                              0x1
#define _HLVDCON_HLVDL0_MASK                                0x1
#define _HLVDCON_HLVDL1_POSN                                0x1
#define _HLVDCON_HLVDL1_POSITION                            0x1
#define _HLVDCON_HLVDL1_SIZE                                0x1
#define _HLVDCON_HLVDL1_LENGTH                              0x1
#define _HLVDCON_HLVDL1_MASK                                0x2
#define _HLVDCON_HLVDL2_POSN                                0x2
#define _HLVDCON_HLVDL2_POSITION                            0x2
#define _HLVDCON_HLVDL2_SIZE                                0x1
#define _HLVDCON_HLVDL2_LENGTH                              0x1
#define _HLVDCON_HLVDL2_MASK                                0x4
#define _HLVDCON_HLVDL3_POSN                                0x3
#define _HLVDCON_HLVDL3_POSITION                            0x3
#define _HLVDCON_HLVDL3_SIZE                                0x1
#define _HLVDCON_HLVDL3_LENGTH                              0x1
#define _HLVDCON_HLVDL3_MASK                                0x8

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0xFA9);
#ifndef _LIB_BUILD
asm("IPR6 equ 0FA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1IP                 :1;
        unsigned CMP2IP                 :1;
        unsigned CMP3IP                 :1;
        unsigned                        :1;
        unsigned TX3IP                  :1;
        unsigned RC3IP                  :1;
        unsigned TX4IP                  :1;
        unsigned RC4IP                  :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0xFA9);
// bitfield macros
#define _IPR6_CMP1IP_POSN                                   0x0
#define _IPR6_CMP1IP_POSITION                               0x0
#define _IPR6_CMP1IP_SIZE                                   0x1
#define _IPR6_CMP1IP_LENGTH                                 0x1
#define _IPR6_CMP1IP_MASK                                   0x1
#define _IPR6_CMP2IP_POSN                                   0x1
#define _IPR6_CMP2IP_POSITION                               0x1
#define _IPR6_CMP2IP_SIZE                                   0x1
#define _IPR6_CMP2IP_LENGTH                                 0x1
#define _IPR6_CMP2IP_MASK                                   0x2
#define _IPR6_CMP3IP_POSN                                   0x2
#define _IPR6_CMP3IP_POSITION                               0x2
#define _IPR6_CMP3IP_SIZE                                   0x1
#define _IPR6_CMP3IP_LENGTH                                 0x1
#define _IPR6_CMP3IP_MASK                                   0x4
#define _IPR6_TX3IP_POSN                                    0x4
#define _IPR6_TX3IP_POSITION                                0x4
#define _IPR6_TX3IP_SIZE                                    0x1
#define _IPR6_TX3IP_LENGTH                                  0x1
#define _IPR6_TX3IP_MASK                                    0x10
#define _IPR6_RC3IP_POSN                                    0x5
#define _IPR6_RC3IP_POSITION                                0x5
#define _IPR6_RC3IP_SIZE                                    0x1
#define _IPR6_RC3IP_LENGTH                                  0x1
#define _IPR6_RC3IP_MASK                                    0x20
#define _IPR6_TX4IP_POSN                                    0x6
#define _IPR6_TX4IP_POSITION                                0x6
#define _IPR6_TX4IP_SIZE                                    0x1
#define _IPR6_TX4IP_LENGTH                                  0x1
#define _IPR6_TX4IP_MASK                                    0x40
#define _IPR6_RC4IP_POSN                                    0x7
#define _IPR6_RC4IP_POSITION                                0x7
#define _IPR6_RC4IP_SIZE                                    0x1
#define _IPR6_RC4IP_LENGTH                                  0x1
#define _IPR6_RC4IP_MASK                                    0x80

// Register: T1GCON
#define T1GCON T1GCON
extern volatile unsigned char           T1GCON              __at(0xFAA);
#ifndef _LIB_BUILD
asm("T1GCON equ 0FAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned T1GGO_NOT_T1DONE       :1;
    };
    struct {
        unsigned T1GSS                  :2;
        unsigned T1GVAL                 :1;
        unsigned T1GGO_nT1DONE          :1;
        unsigned T1GSPM                 :1;
        unsigned T1GTM                  :1;
        unsigned T1GPOL                 :1;
        unsigned TMR1GE                 :1;
    };
    struct {
        unsigned T1GSS0                 :1;
        unsigned T1GSS1                 :1;
        unsigned                        :1;
        unsigned T1GGO                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T1DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned nT1DONE                :1;
    };
} T1GCONbits_t;
