MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
// Register: CVRCONH
#define CVRCONH CVRCONH
extern volatile unsigned char           CVRCONH             __at(0xFBF);
#ifndef _LIB_BUILD
asm("CVRCONH equ 0FBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CVR                    :5;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
        unsigned CVR4                   :1;
    };
} CVRCONHbits_t;
extern volatile CVRCONHbits_t CVRCONHbits __at(0xFBF);
// bitfield macros
#define _CVRCONH_CVR_POSN                                   0x0
#define _CVRCONH_CVR_POSITION                               0x0
#define _CVRCONH_CVR_SIZE                                   0x5
#define _CVRCONH_CVR_LENGTH                                 0x5
#define _CVRCONH_CVR_MASK                                   0x1F
#define _CVRCONH_CVR0_POSN                                  0x0
#define _CVRCONH_CVR0_POSITION                              0x0
#define _CVRCONH_CVR0_SIZE                                  0x1
#define _CVRCONH_CVR0_LENGTH                                0x1
#define _CVRCONH_CVR0_MASK                                  0x1
#define _CVRCONH_CVR1_POSN                                  0x1
#define _CVRCONH_CVR1_POSITION                              0x1
#define _CVRCONH_CVR1_SIZE                                  0x1
#define _CVRCONH_CVR1_LENGTH                                0x1
#define _CVRCONH_CVR1_MASK                                  0x2
#define _CVRCONH_CVR2_POSN                                  0x2
#define _CVRCONH_CVR2_POSITION                              0x2
#define _CVRCONH_CVR2_SIZE                                  0x1
#define _CVRCONH_CVR2_LENGTH                                0x1
#define _CVRCONH_CVR2_MASK                                  0x4
#define _CVRCONH_CVR3_POSN                                  0x3
#define _CVRCONH_CVR3_POSITION                              0x3
#define _CVRCONH_CVR3_SIZE                                  0x1
#define _CVRCONH_CVR3_LENGTH                                0x1
#define _CVRCONH_CVR3_MASK                                  0x8
#define _CVRCONH_CVR4_POSN                                  0x4
#define _CVRCONH_CVR4_POSITION                              0x4
#define _CVRCONH_CVR4_SIZE                                  0x1
#define _CVRCONH_CVR4_LENGTH                                0x1
#define _CVRCONH_CVR4_MASK                                  0x10

// Register: ADCON1L
#define ADCON1L ADCON1L
extern volatile unsigned char           ADCON1L             __at(0xFC0);
#ifndef _LIB_BUILD
asm("ADCON1L equ 0FC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DONE                   :1;
        unsigned SAMP                   :1;
        unsigned ASAM                   :1;
        unsigned                        :1;
        unsigned SSRC                   :4;
    };
    struct {
        unsigned                        :4;
        unsigned SSRC0                  :1;
        unsigned SSRC1                  :1;
        unsigned SSRC2                  :1;
        unsigned SSRC3                  :1;
    };
} ADCON1Lbits_t;
extern volatile ADCON1Lbits_t ADCON1Lbits __at(0xFC0);
// bitfield macros
#define _ADCON1L_DONE_POSN                                  0x0
#define _ADCON1L_DONE_POSITION                              0x0
#define _ADCON1L_DONE_SIZE                                  0x1
#define _ADCON1L_DONE_LENGTH                                0x1
#define _ADCON1L_DONE_MASK                                  0x1
#define _ADCON1L_SAMP_POSN                                  0x1
#define _ADCON1L_SAMP_POSITION                              0x1
#define _ADCON1L_SAMP_SIZE                                  0x1
#define _ADCON1L_SAMP_LENGTH                                0x1
#define _ADCON1L_SAMP_MASK                                  0x2
#define _ADCON1L_ASAM_POSN                                  0x2
#define _ADCON1L_ASAM_POSITION                              0x2
#define _ADCON1L_ASAM_SIZE                                  0x1
#define _ADCON1L_ASAM_LENGTH                                0x1
#define _ADCON1L_ASAM_MASK                                  0x4
#define _ADCON1L_SSRC_POSN                                  0x4
#define _ADCON1L_SSRC_POSITION                              0x4
#define _ADCON1L_SSRC_SIZE                                  0x4
#define _ADCON1L_SSRC_LENGTH                                0x4
#define _ADCON1L_SSRC_MASK                                  0xF0
#define _ADCON1L_SSRC0_POSN                                 0x4
#define _ADCON1L_SSRC0_POSITION                             0x4
#define _ADCON1L_SSRC0_SIZE                                 0x1
#define _ADCON1L_SSRC0_LENGTH                               0x1
#define _ADCON1L_SSRC0_MASK                                 0x10
#define _ADCON1L_SSRC1_POSN                                 0x5
#define _ADCON1L_SSRC1_POSITION                             0x5
#define _ADCON1L_SSRC1_SIZE                                 0x1
#define _ADCON1L_SSRC1_LENGTH                               0x1
#define _ADCON1L_SSRC1_MASK                                 0x20
#define _ADCON1L_SSRC2_POSN                                 0x6
#define _ADCON1L_SSRC2_POSITION                             0x6
#define _ADCON1L_SSRC2_SIZE                                 0x1
#define _ADCON1L_SSRC2_LENGTH                               0x1
#define _ADCON1L_SSRC2_MASK                                 0x40
#define _ADCON1L_SSRC3_POSN                                 0x7
#define _ADCON1L_SSRC3_POSITION                             0x7
#define _ADCON1L_SSRC3_SIZE                                 0x1
#define _ADCON1L_SSRC3_LENGTH                               0x1
#define _ADCON1L_SSRC3_MASK                                 0x80

// Register: ADCON1H
#define ADCON1H ADCON1H
extern volatile unsigned char           ADCON1H             __at(0xFC1);
#ifndef _LIB_BUILD
asm("ADCON1H equ 0FC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FORM                   :2;
        unsigned MODE12                 :1;
        unsigned                        :4;
        unsigned ADON                   :1;
    };
    struct {
        unsigned FORM0                  :1;
        unsigned FORM1                  :1;
    };
} ADCON1Hbits_t;
extern volatile ADCON1Hbits_t ADCON1Hbits __at(0xFC1);
// bitfield macros
#define _ADCON1H_FORM_POSN                                  0x0
#define _ADCON1H_FORM_POSITION                              0x0
#define _ADCON1H_FORM_SIZE                                  0x2
#define _ADCON1H_FORM_LENGTH                                0x2
#define _ADCON1H_FORM_MASK                                  0x3
#define _ADCON1H_MODE12_POSN                                0x2
#define _ADCON1H_MODE12_POSITION                            0x2
#define _ADCON1H_MODE12_SIZE                                0x1
#define _ADCON1H_MODE12_LENGTH                              0x1
#define _ADCON1H_MODE12_MASK                                0x4
#define _ADCON1H_ADON_POSN                                  0x7
#define _ADCON1H_ADON_POSITION                              0x7
#define _ADCON1H_ADON_SIZE                                  0x1
#define _ADCON1H_ADON_LENGTH                                0x1
#define _ADCON1H_ADON_MASK                                  0x80
#define _ADCON1H_FORM0_POSN                                 0x0
#define _ADCON1H_FORM0_POSITION                             0x0
#define _ADCON1H_FORM0_SIZE                                 0x1
#define _ADCON1H_FORM0_LENGTH                               0x1
#define _ADCON1H_FORM0_MASK                                 0x1
#define _ADCON1H_FORM1_POSN                                 0x1
#define _ADCON1H_FORM1_POSITION                             0x1
#define _ADCON1H_FORM1_SIZE                                 0x1
#define _ADCON1H_FORM1_LENGTH                               0x1
#define _ADCON1H_FORM1_MASK                                 0x2

// Register: ADCBUF0
#define ADCBUF0 ADCBUF0
extern volatile unsigned short          ADCBUF0             __at(0xFC2);
#ifndef _LIB_BUILD
asm("ADCBUF0 equ 0FC2h");
#endif

