MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J94/mcu.h
extern volatile __bit                   SSPOV1              __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// ADCON1L<SSRC0>
extern volatile __bit                   SSRC0               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 SSRC0_bit           _BIT_ACCESS(ADCON1L,4)
// ADCON1L<SSRC1>
extern volatile __bit                   SSRC1               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 SSRC1_bit           _BIT_ACCESS(ADCON1L,5)
// ADCON1L<SSRC2>
extern volatile __bit                   SSRC2               __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 SSRC2_bit           _BIT_ACCESS(ADCON1L,6)
// ADCON1L<SSRC3>
extern volatile __bit                   SSRC3               __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 SSRC3_bit           _BIT_ACCESS(ADCON1L,7)
// UIE<STALLIE>
extern volatile __bit                   STALLIE             __at(0x7085);	// @ (0xE10 * 8 + 5)
#define                                 STALLIE_bit         _BIT_ACCESS(UIE,5)
// UIR<STALLIF>
extern volatile __bit                   STALLIF             __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 STALLIF_bit         _BIT_ACCESS(UIR,5)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// RCON3<STKERR>
extern volatile __bit                   STKERR              __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 STKERR_bit          _BIT_ACCESS(RCON3,7)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// PSTR1CON<STRA1>
extern volatile __bit                   STRA1               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 STRA1_bit           _BIT_ACCESS(PSTR1CON,0)
// PSTR2CON<STRA2>
extern volatile __bit                   STRA2               __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 STRA2_bit           _BIT_ACCESS(PSTR2CON,0)
// PSTR3CON<STRA3>
extern volatile __bit                   STRA3               __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 STRA3_bit           _BIT_ACCESS(PSTR3CON,0)
// PSTR1CON<STRB1>
extern volatile __bit                   STRB1               __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 STRB1_bit           _BIT_ACCESS(PSTR1CON,1)
// PSTR2CON<STRB2>
extern volatile __bit                   STRB2               __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 STRB2_bit           _BIT_ACCESS(PSTR2CON,1)
// PSTR3CON<STRB3>
extern volatile __bit                   STRB3               __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 STRB3_bit           _BIT_ACCESS(PSTR3CON,1)
// PSTR1CON<STRC1>
extern volatile __bit                   STRC1               __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 STRC1_bit           _BIT_ACCESS(PSTR1CON,2)
// PSTR2CON<STRC2>
extern volatile __bit                   STRC2               __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 STRC2_bit           _BIT_ACCESS(PSTR2CON,2)
// PSTR3CON<STRC3>
extern volatile __bit                   STRC3               __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 STRC3_bit           _BIT_ACCESS(PSTR3CON,2)
// PSTR1CON<STRD1>
extern volatile __bit                   STRD1               __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 STRD1_bit           _BIT_ACCESS(PSTR1CON,3)
// PSTR2CON<STRD2>
extern volatile __bit                   STRD2               __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 STRD2_bit           _BIT_ACCESS(PSTR2CON,3)
// PSTR3CON<STRD3>
extern volatile __bit                   STRD3               __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 STRD3_bit           _BIT_ACCESS(PSTR3CON,3)
// PSTR1CON<STRSYNC1>
extern volatile __bit                   STRSYNC1            __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 STRSYNC1_bit        _BIT_ACCESS(PSTR1CON,4)
// PSTR2CON<STRSYNC2>
extern volatile __bit                   STRSYNC2            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 STRSYNC2_bit        _BIT_ACCESS(PSTR2CON,4)
// PSTR3CON<STRSYNC3>
extern volatile __bit                   STRSYNC3            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 STRSYNC3_bit        _BIT_ACCESS(PSTR3CON,4)
// UCON<SUSPND>
extern volatile __bit                   SUSPND              __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 SUSPND_bit          _BIT_ACCESS(UCON,1)
// RCON2<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 SWDTEN_bit          _BIT_ACCESS(RCON2,5)
// TXSTA1<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TXSTA1,4)
// T0CON<T08BIT>
extern volatile __bit                   T08BIT              __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T08BIT_bit          _BIT_ACCESS(T0CON,6)
// RPINR38_39<T0CKIR0>
extern volatile __bit                   T0CKIR0             __at(0x71EC);	// @ (0xE3D * 8 + 4)
#define                                 T0CKIR0_bit         _BIT_ACCESS(RPINR38_39,4)
// RPINR38_39<T0CKIR1>
extern volatile __bit                   T0CKIR1             __at(0x71ED);	// @ (0xE3D * 8 + 5)
#define                                 T0CKIR1_bit         _BIT_ACCESS(RPINR38_39,5)
// RPINR38_39<T0CKIR2>
extern volatile __bit                   T0CKIR2             __at(0x71EE);	// @ (0xE3D * 8 + 6)
#define                                 T0CKIR2_bit         _BIT_ACCESS(RPINR38_39,6)
// RPINR38_39<T0CKIR3>
extern volatile __bit                   T0CKIR3             __at(0x71EF);	// @ (0xE3D * 8 + 7)
#define                                 T0CKIR3_bit         _BIT_ACCESS(RPINR38_39,7)
// T0CON<T0CS0>
extern volatile __bit                   T0CS0               __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON,4)
// T0CON<T0CS1>
extern volatile __bit                   T0CS1               __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// INTCON2<T0IP>
extern volatile __bit                   T0IP                __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 T0IP_bit            _BIT_ACCESS(INTCON2,2)
// T0CON<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON,0)
// T0CON<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON,1)
// T0CON<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0PS2_bit           _BIT_ACCESS(T0CON,2)
// RPINR40_41<T1CKIR0>
extern volatile __bit                   T1CKIR0             __at(0x71F4);	// @ (0xE3E * 8 + 4)
#define                                 T1CKIR0_bit         _BIT_ACCESS(RPINR40_41,4)
// RPINR40_41<T1CKIR1>
extern volatile __bit                   T1CKIR1             __at(0x71F5);	// @ (0xE3E * 8 + 5)
#define                                 T1CKIR1_bit         _BIT_ACCESS(RPINR40_41,5)
// RPINR40_41<T1CKIR2>
extern volatile __bit                   T1CKIR2             __at(0x71F6);	// @ (0xE3E * 8 + 6)
#define                                 T1CKIR2_bit         _BIT_ACCESS(RPINR40_41,6)
// RPINR40_41<T1CKIR3>
extern volatile __bit                   T1CKIR3             __at(0x71F7);	// @ (0xE3E * 8 + 7)
#define                                 T1CKIR3_bit         _BIT_ACCESS(RPINR40_41,7)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_NOT_T1DONE>
extern volatile __bit                   T1GGO_NOT_T1DONE    __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_NOT_T1DONE_bit _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_nT1DONE>
extern volatile __bit                   T1GGO_nT1DONE       __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_nT1DONE_bit   _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0x7D56);	// @ (0xFAA * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// RPINR40_41<T1GR0>
extern volatile __bit                   T1GR0               __at(0x71F0);	// @ (0xE3E * 8 + 0)
#define                                 T1GR0_bit           _BIT_ACCESS(RPINR40_41,0)
// RPINR40_41<T1GR1>
extern volatile __bit                   T1GR1               __at(0x71F1);	// @ (0xE3E * 8 + 1)
#define                                 T1GR1_bit           _BIT_ACCESS(RPINR40_41,1)
// RPINR40_41<T1GR2>
extern volatile __bit                   T1GR2               __at(0x71F2);	// @ (0xE3E * 8 + 2)
#define                                 T1GR2_bit           _BIT_ACCESS(RPINR40_41,2)
// RPINR40_41<T1GR3>
extern volatile __bit                   T1GR3               __at(0x71F3);	// @ (0xE3E * 8 + 3)
#define                                 T1GR3_bit           _BIT_ACCESS(RPINR40_41,3)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0x7D54);	// @ (0xFAA * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0x7D50);	// @ (0xFAA * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0x7D51);	// @ (0xFAA * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0x7D55);	// @ (0xFAA * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0x7D52);	// @ (0xFAA * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// T1CON<T1RD16>
extern volatile __bit                   T1RD16              __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 T1RD16_bit          _BIT_ACCESS(T1CON,7)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0x7E50);	// @ (0xFCA * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0x7E51);	// @ (0xFCA * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0x7E53);	// @ (0xFCA * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0x7E54);	// @ (0xFCA * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0x7E55);	// @ (0xFCA * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0x7E56);	// @ (0xFCA * 8 + 6)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,6)
// RPINR42_43<T3CKIR0>
extern volatile __bit                   T3CKIR0             __at(0x71FC);	// @ (0xE3F * 8 + 4)
#define                                 T3CKIR0_bit         _BIT_ACCESS(RPINR42_43,4)
// RPINR42_43<T3CKIR1>
extern volatile __bit                   T3CKIR1             __at(0x71FD);	// @ (0xE3F * 8 + 5)
#define                                 T3CKIR1_bit         _BIT_ACCESS(RPINR42_43,5)
// RPINR42_43<T3CKIR2>
extern volatile __bit                   T3CKIR2             __at(0x71FE);	// @ (0xE3F * 8 + 6)
#define                                 T3CKIR2_bit         _BIT_ACCESS(RPINR42_43,6)
// RPINR42_43<T3CKIR3>
extern volatile __bit                   T3CKIR3             __at(0x71FF);	// @ (0xE3F * 8 + 7)
#define                                 T3CKIR3_bit         _BIT_ACCESS(RPINR42_43,7)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x7D8C);	// @ (0xFB1 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// LCDDATA19<T3CKPS019>
extern volatile __bit                   T3CKPS019           __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 T3CKPS019_bit       _BIT_ACCESS(LCDDATA19,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x7D8D);	// @ (0xFB1 * 8 + 5)
#define                                 T3CKPS1_bit         _BIT_ACCESS(T3CON,5)
// LCDDATA19<T3CKPS119>
extern volatile __bit                   T3CKPS119           __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 T3CKPS119_bit       _BIT_ACCESS(LCDDATA19,5)
// T3GCON<T3GGO>
extern volatile __bit                   T3GGO               __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_bit           _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GGO_NOT_T3DONE>
extern volatile __bit                   T3GGO_NOT_T3DONE    __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_NOT_T3DONE_bit _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GGO_nT3DONE>
extern volatile __bit                   T3GGO_nT3DONE       __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_nT3DONE_bit   _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x7D86);	// @ (0xFB0 * 8 + 6)
#define                                 T3GPOL_bit          _BIT_ACCESS(T3GCON,6)
// RPINR42_43<T3GR0>
extern volatile __bit                   T3GR0               __at(0x71F8);	// @ (0xE3F * 8 + 0)
#define                                 T3GR0_bit           _BIT_ACCESS(RPINR42_43,0)
// RPINR42_43<T3GR1>
extern volatile __bit                   T3GR1               __at(0x71F9);	// @ (0xE3F * 8 + 1)
#define                                 T3GR1_bit           _BIT_ACCESS(RPINR42_43,1)
// RPINR42_43<T3GR2>
extern volatile __bit                   T3GR2               __at(0x71FA);	// @ (0xE3F * 8 + 2)
#define                                 T3GR2_bit           _BIT_ACCESS(RPINR42_43,2)
// RPINR42_43<T3GR3>
extern volatile __bit                   T3GR3               __at(0x71FB);	// @ (0xE3F * 8 + 3)
#define                                 T3GR3_bit           _BIT_ACCESS(RPINR42_43,3)
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x7D84);	// @ (0xFB0 * 8 + 4)
#define                                 T3GSPM_bit          _BIT_ACCESS(T3GCON,4)
// T3GCON<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x7D80);	// @ (0xFB0 * 8 + 0)
#define                                 T3GSS0_bit          _BIT_ACCESS(T3GCON,0)
// T3GCON<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x7D81);	// @ (0xFB0 * 8 + 1)
#define                                 T3GSS1_bit          _BIT_ACCESS(T3GCON,1)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x7D85);	// @ (0xFB0 * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x7D82);	// @ (0xFB0 * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3OSCEN>
extern volatile __bit                   T3OSCEN             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 T3OSCEN_bit         _BIT_ACCESS(T3CON,3)
// T3CON<T3RD16>
extern volatile __bit                   T3RD16              __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 T3RD16_bit          _BIT_ACCESS(T3CON,7)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x7820);	// @ (0xF04 * 8 + 0)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,0)
// LCDDATA16<T4CKPS016>
extern volatile __bit                   T4CKPS016           __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 T4CKPS016_bit       _BIT_ACCESS(LCDDATA16,0)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x7821);	// @ (0xF04 * 8 + 1)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,1)
// LCDDATA16<T4CKPS116>
extern volatile __bit                   T4CKPS116           __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 T4CKPS116_bit       _BIT_ACCESS(LCDDATA16,1)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x7823);	// @ (0xF04 * 8 + 3)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,3)
// LCDDATA16<T4OUTPS016>
extern volatile __bit                   T4OUTPS016          __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 T4OUTPS016_bit      _BIT_ACCESS(LCDDATA16,3)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x7824);	// @ (0xF04 * 8 + 4)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,4)
// LCDDATA16<T4OUTPS116>
extern volatile __bit                   T4OUTPS116          __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 T4OUTPS116_bit      _BIT_ACCESS(LCDDATA16,4)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x7825);	// @ (0xF04 * 8 + 5)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,5)
// LCDDATA16<T4OUTPS216>
extern volatile __bit                   T4OUTPS216          __at(0x74F5);	// @ (0xE9E * 8 + 5)
#define                                 T4OUTPS216_bit      _BIT_ACCESS(LCDDATA16,5)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x7826);	// @ (0xF04 * 8 + 6)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,6)
// LCDDATA16<T4OUTPS316>
extern volatile __bit                   T4OUTPS316          __at(0x74F6);	// @ (0xE9E * 8 + 6)
#define                                 T4OUTPS316_bit      _BIT_ACCESS(LCDDATA16,6)
// RPINR44_45<T5CKIR0>
extern volatile __bit                   T5CKIR0             __at(0x7204);	// @ (0xE40 * 8 + 4)
#define                                 T5CKIR0_bit         _BIT_ACCESS(RPINR44_45,4)
// RPINR44_45<T5CKIR1>
extern volatile __bit                   T5CKIR1             __at(0x7205);	// @ (0xE40 * 8 + 5)
#define                                 T5CKIR1_bit         _BIT_ACCESS(RPINR44_45,5)
// RPINR44_45<T5CKIR2>
extern volatile __bit                   T5CKIR2             __at(0x7206);	// @ (0xE40 * 8 + 6)
#define                                 T5CKIR2_bit         _BIT_ACCESS(RPINR44_45,6)
// RPINR44_45<T5CKIR3>
extern volatile __bit                   T5CKIR3             __at(0x7207);	// @ (0xE40 * 8 + 7)
#define                                 T5CKIR3_bit         _BIT_ACCESS(RPINR44_45,7)
// T5CON<T5CKPS0>
extern volatile __bit                   T5CKPS0             __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 T5CKPS0_bit         _BIT_ACCESS(T5CON,4)
// T5CON<T5CKPS1>
extern volatile __bit                   T5CKPS1             __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 T5CKPS1_bit         _BIT_ACCESS(T5CON,5)
// T5GCON<T5GGO>
extern volatile __bit                   T5GGO               __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 T5GGO_bit           _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_NOT_T5DONE>
extern volatile __bit                   T5GGO_NOT_T5DONE    __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 T5GGO_NOT_T5DONE_bit _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_nT5DONE>
extern volatile __bit                   T5GGO_nT5DONE       __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 T5GGO_nT5DONE_bit   _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GPOL>
extern volatile __bit                   T5GPOL              __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 T5GPOL_bit          _BIT_ACCESS(T5GCON,6)
// RPINR44_45<T5GR0>
extern volatile __bit                   T5GR0               __at(0x7200);	// @ (0xE40 * 8 + 0)
#define                                 T5GR0_bit           _BIT_ACCESS(RPINR44_45,0)
// RPINR44_45<T5GR1>
extern volatile __bit                   T5GR1               __at(0x7201);	// @ (0xE40 * 8 + 1)
#define                                 T5GR1_bit           _BIT_ACCESS(RPINR44_45,1)
// RPINR44_45<T5GR2>
